# Документация API

Этот репозиторий содержит код для Django REST проекта, реализующего систему регистрации и приглашений.

## Аутентификация

Перед использованием защищенных конечных точек, необходимо получить CSRF токен, сделав GET запрос к `/login`.

### Логин
- **Метод**: GET
- **Конечная точка**: `/login`
- **Описание**: Получает токен CSRF для аутентификации.
- **Параметры**: Нет
- **Ответ**: Возвращает токен CSRF для последующих запросов.

## Аутентификация пользователя

### Логин по номеру телефона
- **Метод**: POST
- **Конечная точка**: `/phone_login`
- **Описание**: Аутентификация пользователя с использованием номера телефона.
- **Параметры**:
  - `phone_number`: Номер телефона пользователя
- **Ответ**: Отправляет 4-значный код подтверждения на указанный номер телефона.

### Логин по коду
- **Метод**: POST
- **Конечная точка**: `/code_login`
- **Описание**: Продолжение процесса аутентификации с использованием кода подтверждения.
- **Параметры**:
  - `phone_number`: Номер телефона пользователя
  - `verification_code`: 4-значный код подтверждения
- **Ответ**: При успешном подтверждении назначает пользователю 6-значный код приглашения.

## Управление профилем

### Просмотр профиля
- **Метод**: GET
- **Конечная точка**: `/profile_view`
- **Описание**: Отображает информацию о профиле пользователя, включая код приглашения.
- **Параметры**: Нет
- **Ответ**: Возвращает детали профиля пользователя.

### Отправка кода приглашения из профиля
- **Метод**: POST
- **Конечная точка**: `/profile_send_invite_code`
- **Описание**: Отображает профили пользователей, которые ввели определенный 6-значный код приглашения.
- **Параметры**:
  - `invite_code`: 6-значный код приглашения
- **Ответ**: Возвращает профили пользователей, которые ввели указанный код приглашения.

## Управление пользователями

### Получение пользователей по коду приглашения
- **Метод**: GET
- **Конечная точка**: `/get_users`
- **Описание**: Получает всех пользователей, которые аутентифицировались с использованием определенного кода приглашения.
- **Параметры**:
  - `invite_code`: Код приглашения для фильтрации пользователей
- **Ответ**: Возвращает список пользователей, которые использовали указанный код приглашения для аутентификации.
